[{"Street": "", "City": "", "Zip_Code": "", "Address": "False", "State": "GA", "Id": "2888247", "Notice": "Notice of Foreclosure of Right of RedemptionState of GeorgiaCounty of FultonTo:All residents/tenants/occupantsAll person known or unknown who may claim an interest in property known as 0 Wells Drive or Wells Drive, Atlanta, Georgia 30311 (Property may also formerly be known as 1889 Wells Drive, Atlanta, Georgia 30311Raymont WalkerCity of AtlantaFulton CountyState of Georgia Take notice that: Pursuant to O.C.G.A § 48-4-45 and § 48-4-46, the right to redeem the following described property, to wit:Property Location: 0 Wells Drive or Wells Drive, Atlanta, Georgia 30311 (Property may also formerly be known as 1889 Wells Drive, Atlanta, Georgia 30311)Map Reference No./Parcel No.14-0199-LL-010-2Will expire and be forever foreclosed and barred on July 30, 2023. The tax deed to which this notice relates is dated April 2, 2013 and is recorded in the office of the Clerk of the Superior Court of Fulton County, Georgia in Deed Book 52834, Page 505.The property may be redeemed at any time before the close of business on the aforementioned barment date, by payment of the redemption price as fixed and provided by law to Greene & Burke, LLC at the office of the law firm of McManamy McLeod Heller, LLC at 3520 Piedmont Road, NE, Suite 110, Atlanta, Georgia 30305.", "Publisher": "Fulton County Daily Report", "Date_Added": "2023-06-29 22:56:17"}, {"Street": "", "City": "", "Zip_Code": "", "Address": "False", "State": "GA", "Id": "2886565", "Notice": "350-476496 6/15,6/22,6/29,7/6NOTICE OF FORECLOSURE OF RIGHT OF REDEMPTIONSTATE OF GEORGIACOUNTY OF DEKALBTo:1. All persons known or unknown who may claim an interest in property known as 4621 Ellisbury Drive;2. Resident/Tenant/Occupant;3. Douglas Hope Carter;4. Georgia Department of Revenue;5. DeKalb County;6. City of Dunwoody; and7. State of Georgia.Take notice that: Pursuant to O.C.G.A. §48-4-45 and §48-4-46, the right to redeem the following described property, to wit:Property Location: ++4621 Ellisbury DriveMap Reference No./Parcel No.: 18 354 09 014++will expire and be forever foreclosed and barred on July 24, 2023. The tax deed to which this notice relates is dated June 7, 2022 and is recorded in the office of the Clerk of the Superior Court of DeKalb County, Georgia, in Deed Book 30485, Page 87.The property may be redeemed at any time before the close of business on the aforementioned barment date, by payment of the redemption price as fixed and provided by law to Deed Co, LLC at the offices of W. Shannon Sams Law, PC at 4355 Cobb Pkwy, Ste. J-505, Atlanta, GA 30339.", "Publisher": "The Champion", "Date_Added": "2023-06-29 22:56:32"}, {"Street": "", "City": "", "Zip_Code": "", "Address": "False", "State": "GA", "Id": "2886043", "Notice": "NOTICE OF FORECLOSURE OF RIGHT OF REDEMPTIONSTATE OF GEORGIACOUNTY OF FULTONTo: All persons known or unknown who may claim an interest in property known as 4191 Welcome All Ter;Resident/Tenant/Occupant;Patricia Weaver;First Family Financial Services, Inc., as successor by merger to First Family Financial Services of Georgia, Inc.;Palladium Realty, LLC;Soaring Capital, LLC;City of Atlanta;Fulton County, Georgia;City of South Fulton; andState of Georgia.Take notice that: Pursuant to O.C.G.A. §48-4-45 and §48-4-46, the right to redeem the following described property, to wit:Property Location: 4191 Welcome All TerMap Reference No./Parcel No.: 09F-3608-0153-047-1will expire and be forever foreclosed and barred on July 14, 2023. The tax deed to which this notice relates is dated February 1, 2022 and is recorded in the office of the Clerk of the Superior Court of Fulton County, Georgia, in Deed Book 65756, Page 493.The property may be redeemed at any time before the close of business on the aforementioned barment date, by payment of the redemption price as fixed and provided by law to RH Foy, LLC at the offices of Jett Law Group, LLC at 2987 Clairmont Road, Suite 350, Atlanta, GA 30329.", "Publisher": "Fulton County Daily Report", "Date_Added": "2023-06-29 22:56:46"}, {"Street": "9714 Kings Road", "City": "Gainesville, Forsyth County", "Zip_Code": "30506", "Address": "True", "State": "GA", "Id": "2886826", "Notice": "gpn11\nForeclosures\n(Wilson) NOTICE OF SALE UNDER POWER STATE OF GEORGIA FORSYTH COUNTY THIS IS AN ATTEMPT TO COLLECT A DEBT. ANY INFORMATION OBTAINED WILL BE USED FOR THAT PURPOSE. Under and by virtue of the Power of Sale contained in a First Deed to Secure Debt (hereinafter Security Deed) dated September 15, 2011 and recorded in Deed Book 6052, Page 103 et seq., in the Forsyth County, Georgia deed records given to Sara Wilson, as Borrower, by Habitat for Humanity-North Central Georgia, Inc., as Lender, and conveying the after-described property to secure a Promissory Note (hereinafter Note) in the original principal amount of EIGHTY-FOUR THOUSAND TWO HUNDRED FIFTEEN AND 00/100 DOLLARS ($84,215.00), with interest thereon at the specified rate therein, there will be sold by the undersigned at public outcry to the highest bidder for cash before the courthouse door of Forsyth County, Georgia within the legal hours of sale on July 5, 2023 the following described property: SEE EXHIBIT A ATTACHED HERETO AND MADE A PART HEREOF. The debt secured by said Security Deed has been and is hereby declared due because of, among other possible events of default, failure to pay the indebtedness as when due and in the manner provided in the Note and Security Deed. The debt remaining in default, this sale will be made for the purpose of paying the same and all expenses of this sale, as provided in the Security Deed and by law, including attorneys fees (notice of intent to collect attorneys fees having been previously given). Said property is commonly known as 9714 Kings Road, Gainesville, Forsyth County, Georgia 30506 together will all fixtures and personal property attached to and constituting a part of said property, if any. To the best knowledge and belief of the undersigned, the parties in possession of the subject property is/are: Sara Wilson or other occupants, tenants or residents. Habitat for Humanity-North Central Georgia, Inc., is the holder of the Note and the Security Deed to the property in accordance with O.C.G.A. SS 44-14-162.2. It is the entity who has full authority to negotiate, amend, and modify all terms of the mortgage pursuant to established guidelines. Habitat for Humanity-North Central Georgia, Inc., 814 Mimosa Blvd., Roswell, Georgia 30075; Tel. No. (770) 587-9679. Note, however, that such entity or individual is not required by law to negotiate, amend, or modify the terms of the loan. Said property will be sold subject to: (a) any outstanding ad valorem taxes (including taxes which are a lien, but not yet due and payable), and (b) unpaid water or sewerage bills that constitute a lien against the property whether due and payable or not yet due and payable and which may not be of record, (c) the right of redemption of any taxing authority, (d) any matters which might be disclosed by an accurate survey and inspection of the property, and (e) any assessments, liens, encumbrances, zoning ordinances, restrictions, covenants, and matters of record superior to the Security Deed first set out above. The sale will be conducted subject to (1) confirmation that the sale is not prohibited under the U.S. Bankruptcy Code; and (2) final confirmation and audit of the status of the loan with the holder of the Security Deed. Pursuant to O.C.G.A. SS 9-13-172.1, which allows for certain procedure regarding the rescission of judicial and non-judicial sales in the State of Georgia, the Deed under Power and other foreclosure documents may not be provided until final confirmation and audit of the status of the loan as provided immediately above. HABITAT FOR HUMANITY- North Central Georgia, Inc., As agent and Attorney in Fact for Sara Wilson /s/ Kurt. R. Hilbert KURT R. HILBERT The Hilbert Law Firm, LLC 205 Norcross Street Roswell, Georgia 30075 T: (770) 551-9310 F: (770) 551-9311 E: khilbert@hilbertlaw.com THIS IS AN ATTEMPT TO COLLECT A DEBT. ANY INFORMATION OBTAINED WILL BE USED FOR THAT PURPOSE. 122413, 6/7, 6/14, 6/21, 6/28", "Publisher": "Forsyth County News", "Date_Added": "2023-06-29 22:56:57"}, {"Street": "", "City": "", "Zip_Code": "", "Address": "False", "State": "GA", "Id": "2885500", "Notice": "gpn11 wm8436 Wm8436 gpn11 In the Superior Court of Walker County, Georgia Civil Action File Number 23SUCV0217 THE RESIDENCES AT MCLEMORE HOMEOWNERS ASSOCIATION INC. and MCLEMORE CLUB, LLC, Plaintiffs, v. GLORIA A. ELLWOOD, Defendant. NOTICE OF PUBLICATION TO: Gloria A. Ellwood, (address and whereabouts unknown). By order of the Court for service by publication dated May 25, 2023, you are hereby notified that on March 21, 2023, THE RESIDENCES AT MCLEMORE HOMEOWNERS ASSOCIATION INC. and MCLEMORE CLUB, LLC filed suit against you for judicial foreclosure as to certain property located in Walker County, Georgia. You are required to file with the Clerk of the Superior Court and to serve upon counsel for the plaintiffs, C. Ballard Scearce Jr., The Scearce law Firm P.C., 1413 Chestnut Street, Suite 203, Chattanooga. TN 37402, an answer in writing within sixty (60) days of May 25, 2023. This the 31 st day of May, 2023. Honorable Brian House. /s/ Deputy Clerk of Superior Court For Walker County: Carter Brown, P.O. Box 1125, Lafayette, GA 30728. 6:7,14,21,28,2023", "Publisher": "Walker County Messenger", "Date_Added": "2023-06-29 22:57:38"}, {"Street": "3539 Mulberry Way", "City": "Duluth", "Zip_Code": "30096", "Address": "True", "State": "GA", "Id": "2884892", "Notice": "gpn18 GDP2709 GDP2709 gpn18 IN THE SUPERIOR COURT OF GWINNETT COUNTY STATE OF GEORGIA CIVIL ACTION NO. 23-A-00036-1 WOODEHAVEN AT CHATTAHOOCHEE CROSSING PROPERTY OWNERS, PLAINTIFF VS. KELA Y. HENRY, DEFENDANT TO: KELA Y. HENRY, 3539 MULBERRY WAY, DULUTH, GEORGIA 30096 (LAST KNOWN ADDRESS) NOTICE OF PUBLICATION By order for service by publication dated the 24th day of May, 2023. You are hereby notified that on the 3rd day of January, 2023, Woodehaven at Chattahoochee Crossing Property Owners Association, Inc. filed suit against you for damages and judicial foreclosure of the property located at 3539 Mulberry Way, Duluth, Georgia 30096. You are required to file with the Clerk of the Superior Court, and to serve upon Plaintiffs Attorney, Stephen A. Finamore Lueder, Larkin & Hunter, LLC 5900 Windward Parkway Suite 390 Alpharetta, GA 30005 an answer in writing within sixty(60) days of the date of the order of publication. This 2nd day of May, 2023. Clerk of Superior Court Gwinnett County, State of Georgia By:_____ Deputy Clerk- Gwinnett Superior Court 6/28,7/5,12,19,2023", "Publisher": "Gwinnett Daily Post", "Date_Added": "2023-06-29 22:57:49"}, {"Street": "", "City": "", "Zip_Code": "", "Address": "False", "State": "GA", "Id": "2884887", "Notice": "gpn18 GDP2582 GDP2582 gpn18 IN THE STATE COURT OF GWINNETT COUNTY STATE OF GEORGIA Civil Action File No. 23C-01958-S4 WYNBROOKE COMMUNITY ASSOCIATION, INC., Plaintiff, v. SHEENA HOLIDAY-PARKER, Defendant. NOTICE OF PUBLICATION To: Sheens Holiday-Parker 6753 Danforth Way Stone Mountain, GA 30087 Sheena Holiday Parker 4002 Highway 78 W., Suite 530 Snellville, GA 30039 YOU ARE HEREBY NOTIFIED that the above-styled action seeking judicial foreclosure of lien and damages for non-payment of assessments was filed against you in said Court on March 24, 2023 and that by reason of an order for service of summons by publication signed by the Court on May 23, 2023 you are hereby commanded and required to file with the Clerk of said Court and serve upon the firm of PANKEY & HORLOCK, LLC, 1441 DUNWOODY VILLAGE PARKWAY, SUITE 200, ATLANTA, GA 30338, an Answer to the Complaint within sixty (60) days of the date of the Order by Publication. WITNESS the Hon. Colvin Leary This 25TH day of MAY 2023. -s- Clerk of Court State Court of Gwinnett County, GA State of Georgia 6/21,28,7/5,12,2023", "Publisher": "Gwinnett Daily Post", "Date_Added": "2023-06-29 22:58:17"}, {"Street": "2920 Storybook Lane", "City": "Grayson", "Zip_Code": "30017", "Address": "True", "State": "GA", "Id": "2884882", "Notice": "gpn18 GDP2413 GDP2413 gpn18 IN THE SUPERIOR COURT OF GWINNETT COUNTY STATE OF GEORGIA CIVIL ACTION NO. 22-A-09060-10 HAWTHORN GLEN HOMEOWNERS ASSOCIATION, INC..., PLAINTIFF VS. MARY ANN HARRIS & JOSEPH P. HARRIS, DEFENDANTS TO: MARY ANN HARRIS & JOSEPH P. HARRIS (LAST KNOWN ADDRESS) NOTICE OF PUBLICATION By order for service by publication dated the 4th day of May, 2023 rendered by the Honorable Judge Warren Davis You are hereby notified that on the 18th day of October, 2022 Hawthorn Glen Homeowners Association, Inc. filed a lawsuit against you for damages and judicial foreclosure concerning the property located at 2920 Storybook Lane, Grayson, Georgia 30017 You are required to file with the Clerk of the Superior Court, and to serve upon Plaintiffs Attorney: Darrelyn S. Hughes Lueder, Larkin, & Hunter, LLC 5900 Windward Parkway, Suite 390, Alpharetta, GA 30005 an answer in writing within sixty (60) days of the date of the order of publication. WITNESS the Honorable WARREN DAVIS Judge of the Superior Court for Gwinnett County. This 8th day of May, 2023 CLERK OF SUPERIOR COURT GWINNETT COUNTY, STATE OF GEORGIA. 6/14,21,28,7/5,2023", "Publisher": "Gwinnett Daily Post", "Date_Added": "2023-06-29 22:58:32"}, {"Street": "", "City": "", "Zip_Code": "", "Address": "False", "State": "GA", "Id": "2884365", "Notice": "IN THE SUPERIOR COURT OF FULTON COUNTY STATE OF GEORGIA CIVIL ACTION NO. 2023CV378929PARKLANE ON PEACHTREE CONDOMINIUM ASSOCIATION, INC., PLAINTIFF VS. INDIGO T. GIVENCHY, DEFENDANTTO: INDIGO T. GIVENCHY, 2479 Peachtree Road NE #1608, Atlanta, Georgia 30305 (LAST KNOWN ADDRESS)NOTICE OF PUBLICATION By order for serviceby publication dated the 13st day of June, 2023. Youare hereby notified that on the 17th day of April, 2023,Parklane on Peachtree Condominium Association, Inc. filed suit against you for damages and judicial foreclosure of the property located at 2479 Peachtree Road NE #1608, Atlanta, Georgia 30305. You are commanded to file with the Clerk of the Fulton Superior Court, and to serve upon Plaintiffs Attorney, Stephen A. FinamoreLueder, Larkin, & Hunter, LLC5900 Windward Parkway, Suite 390, Alpharetta, GA 30005an answer in writing within sixty (60) days of the dateof the order of publication. WITNESS the Honorable Eric K. DunawayJudge of the Superior Court for Fulton County. This 14 day of June, 2023. CLERK OF SUPERIOR COURTFULTON COUNTY, STATE OF GEORGIA. By: /s/ Cathlene RobinsonDeputy Clerk \u0096 Fulton Superior Court", "Publisher": "Fulton County Daily Report", "Date_Added": "2023-06-29 22:58:46"}, {"Street": "6137 Rockaway Road", "City": "Atlanta", "Zip_Code": "30349", "Address": "True", "State": "GA", "Id": "2883265", "Notice": "IN THE SUPERIOR COURT OF FULTON COUNTY STATE OF GEORGIA CIVIL ACTION NO. 2023CV380332WOODWARD HILLS UNIT TWO TOWNHOME ASSOCIATION, INC., PLAINTIFFVS.UNKNOWN HEIRS OF THE ESTATE OF SHIRLEY RHODES and EBONE S. ALLOWAY,DEFENDANTS.TO: UNKNOWN HEIRS OF THE ESTATE OF SHIRLEY RHODES, 6137 ROCKAWAYROAD, ATLANTA, GEORGIA, 30349 (LAST KNOWN ADDRESS)NOTICE OF PUBLICATION By order for service by publication dated the 9th day of June,2023. You are hereby notified that on the 17th day of May, 2023, Woodward Hills Unit TwoTownhome Association, Inc. filed suit against you for damages and judicial foreclosure of theproperty located at 6137 Rockaway Road, Atlanta, Georgia 30349. You are required to file withthe Clerk of the Superior Court, and to serve upon: Plaintiffs Attorney, Brittany R. Brock,Lueder, Larkin, & Hunter, LLC 5900 Windward Parkway, Suite 390, Alpharetta, GA 30005, ananswer in writing within sixty (60) days of the date of the order of publication.WITNESS the Honorable Jane C. BarwickJudge of the Superior Court for Fulton County.This 20th day of June, 2023.Cathelene RobinsonClerk of Superior Court, Fulton County Georgia", "Publisher": "Fulton County Daily Report", "Date_Added": "2023-06-29 22:59:00"}, {"Street": "", "City": "", "Zip_Code": "", "Address": "False", "State": "GA", "Id": "2883032", "Notice": "NOTICE OF FORECLOSURE OF RIGHT OF REDEMPTIONSTATE OF GEORGIACOUNTY OF FULTONTo: All persons known or unknown who may claim an interest in property known as 841 Sandy Creek Drive, NW; andImmunity Investment, LLC.Take notice that: Pursuant to O.C.G.A. §48-4-45 and §48-4-46, the right to redeem the following described property, to wit:Property Location: 841 Sandy Creek Drive, NWMap Reference No./Parcel No.: 14 -0241-0002-080-0will expire and be forever foreclosed and barred on July 17, 2023. The tax deed to which this notice relates is dated September 7, 2021 and is recorded in the office of the Clerk of the Superior Court of Fulton County, Georgia, in Deed Book 65212, Page 390.The property may be redeemed at any time before the close of business on the aforementioned barment date, by payment of the redemption price as fixed and provided by law to NR Deed, LLC at the offices of W. Shannon Sams Law, PC at 4355 Cobb Pkwy, Ste. J-505, Atlanta, GA 30339.", "Publisher": "Fulton County Daily Report", "Date_Added": "2023-06-29 22:59:15"}, {"Street": "", "City": "", "Zip_Code": "", "Address": "False", "State": "GA", "Id": "2882853", "Notice": "Wednesday Publication Deadline: 3pm Tuesday the week prior Sunday Publication Deadline: 12 Noon Tuesday of the same week. Foreclosure Deadlines: Please send a request for a deadline calendar to the email below. Email: legals@gwinnett dailypost.com Legal Notice Deadlines", "Publisher": "Gwinnett Daily Post", "Date_Added": "2023-06-29 22:59:30"}, {"Street": "", "City": "", "Zip_Code": "", "Address": "False", "State": "GA", "Id": "2881916", "Notice": "IN THE SUPERIOR COURT OF FULTON COUNTY, STATE OF GEORGIA CIVIL ACTION FILE NO. 2023CV379543In the matter of:STONE MANOR CONDOMINIUM ASSOCIATION, INC.v.HILLARY T. LEASURE AND KAYCE MAISEL, AS CO-TRUSTEES OF THE STONE MANOR #D12 IRREVOCABLE TRUSTStone Manor Condominium Association, Inc. issues this NOTICE OF PUBLICATION by Court Order for service by publication dated June 12, 2023.Kayce Maisel, as Co-Trustee of the Stone Manor #D12 Irrevocable Trust is hereby notified that on May 2, 2023, Stone Manor Condominium Association, Inc., filed suit against you for money owed and foreclosure on an account and contract. You are required to file with the Clerk of Court and to serve upon plaintiffs attorney, Mary Beth Sierra, an answer in writing within sixty (60) days of the date of the order for publication referenced above.#0000668751:6/16-4AS", "Publisher": "Fulton County Daily Report", "Date_Added": "2023-06-29 22:59:43"}, {"Street": "", "City": "", "Zip_Code": "", "Address": "False", "State": "GA", "Id": "2881338", "Notice": "NOTICE OF FORECLOSURE OF RIGHT OF REDEMPTION STATE OF GEORGIA/COUNTY OF CHATHAM   TO: 1) Estate of Eugene Brown, 2) Unknown Heirs and Assigns of Estate of Eugene Brown, 3) Summerside Neighborhood Association, Inc., 4) all Tenants/Residents/Occupants, 5) Chatham County Tax Commissioner, 6) all persons known or unknown who may claim an interest in property known as Milton Ave., Lt 9 Blk 12 Summerside, Georgia 31405   TAKE NOTICE THAT:   The right to redeem the described property as Milton Ave., Lt 9 Blk 12 Summerside, Georgia 31405 (Tax Parcel 20592 14002), as follows, to wit:   Property Identification Number (PIN) 20592 14002 Lt 9 Blk 12 Summerside, Milton Ave   Will expire and be forever foreclosed and barred on and after the 25th day of August, 2023, or 30 days from service of notice.   The tax deed to which this notice relates is dated the 7th day of June 2022 and is recorded in the office of the Clerk of the Superior Court of Chatham County, Georgia, in Deed Book 2866, Page 332.   The property may be redeemed at any time before 25th day of August, 2023, or 30 days from service of notice, by payment of the redemption price as fixed and provided by law to the undersigned at the following address: David A. Basil, LLC, 301 Bradley Street, Suite B-7, Carrollton, Georgia, 30117.   Please be governed accordingly. 8953672 6/23, 6/30, 7/7, 7/14/2023", "Publisher": "Savannah Morning News", "Date_Added": "2023-06-29 22:59:57"}]